Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.33/saml21b/edc/ATSAML21J18B.PIC
      <edc:SFRDef edc:_addr="0x42003006" edc:access="----nnnn" edc:cname="INTFLAG" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="DAC 0 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="DAC 1 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003007" edc:access="----rrrr" edc:cname="STATUS" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:desc="DAC 0 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:desc="DAC 1 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="DAC 0 End of Conversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="DAC 1 End of Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003008" edc:access="--------------------------rrrrrr" edc:cname="SYNCBUSY" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DAC Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF0" edc:desc="Data Buffer DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF1" edc:desc="Data Buffer DAC 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200300C" edc:access="----nnnnnn--nnnn" edc:cname="DACCTRL0" edc:impl="0xFCF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;=12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 2400US" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 2700US" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200300E" edc:access="----nnnnnn--nnnn" edc:cname="DACCTRL1" edc:impl="0xFCF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;=12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 2400US" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 2700US" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003010" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003012" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
